"""
У чому полягають поняття процесу і потоку? Вкажіть схожість і відмінності цих понять.


Потік - зазвичай виконує найменшу одиницю коду.
Процес - це інстанс певної комп’ютерної програми, яке виконується ОС. Процес містить програмний код, його поточну діяльность та взаємодії з іншими об'єктами.

Схожість:
Обидва класи використовуються для Concurrency, мають однакову API, підтримують однакові Concurrency примітиви.

Відмінності:
Більш ніж один потік може бути реалізований в межах одного процесу для доступу та спільного використання пам’яті чи інших ресурсів, а окремі процеси зазвичай не мають спільних ресурсів.
"""
